In [5]:
# import libraries
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
# import dataset
ds = pd.read_csv("raw_messy_dataset.csv")
ds

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering
...,...,...,...,...,...,...,...
100,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
101,Bob,40,M,user1@example.com,NaN,50000,Engineering
102,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
103,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
104,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [55]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         72 non-null     object
 2   Gender      89 non-null     object
 3   Email       95 non-null     object
 4   Join_Date   70 non-null     object
 5   Salary      78 non-null     object
 6   Department  89 non-null     object
dtypes: object(7)
memory usage: 5.9+ KB

In [56]:
ds.describe()

         Name Age Gender              Email   Join_Date Salary   Department
count     105  72     89                 95          70     78           89
unique     10   5      5                 90           4      5            5
top     Alice  40   Male  user0@example.com  2021-05-21  50000  Engineering
freq       11  22     22                  2          26     22           26

In [18]:
# Searcing for duplicates
ds.duplicated("Name").sum() #sum() - count of duplicates in all data

90

In [21]:
# Remove duplicates

ds.drop_duplicates(inplace = True)

In [22]:
# Searcing for duplicates
ds.duplicated("Name").sum() #sum() - count of duplicates in all data

0

In [60]:
# It returns with column headers 

ds.columns

Index(['Name', 'Age', 'Gender', 'Email', 'Join_Date', 'Salary', 'Department'], dtype='object')

In [61]:
# Hnadling age

ds["Age"] = pd.to_numeric(ds["Age"], errors = "coerce")

In [23]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        10 non-null     object
 1   Age         7 non-null      object
 2   Gender      8 non-null      object
 3   Email       10 non-null     object
 4   Join_Date   7 non-null      object
 5   Salary      8 non-null      object
 6   Department  10 non-null     object
dtypes: object(7)
memory usage: 640.0+ bytes

In [18]:
# convert object to numeric of column age
ds["Age"] = pd.to_numeric(ds["Age"], errors = "coerce")
x = ds["Age"].median()
x

35.0

In [23]:
ds["Age"].fillna(x, inplace = True)

C:\Users\SHRUTI\AppData\Local\Temp\ipykernel_17684\2506757377.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Age"].fillna(x, inplace = True)

In [24]:
ds["Age"].unique()

array([35., 40., 30., 25.])

In [19]:
# Standerdized gender column
ds = pd.read_csv("raw_messy_dataset.csv")
ds["Gender"].replace({
    "M" : "Male", "F": "Female", " ": "None"
})

0        NaN
1       Male
2       Male
3        NaN
4      Other
       ...
100      NaN
101     Male
102     Male
103      NaN
104    Other
Name: Gender, Length: 105, dtype: object

In [26]:
# Handling email column

ds["Email"].fillna("-", inplace = True)

In [27]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         105 non-null    float64
 2   Gender      89 non-null     object
 3   Email       105 non-null    object
 4   Join_Date   70 non-null     object
 5   Salary      78 non-null     object
 6   Department  89 non-null     object
dtypes: float64(1), object(6)
memory usage: 5.9+ KB

In [28]:
# Convert to datetime format

ds["Join_Date"] = pd.to_datetime(ds["Join_Date"], errors = 'coerce')

In [29]:
# handling salary column

ds["Salary"] = pd.to_numeric(ds["Salary"], errors = 'coerce')

In [30]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         105 non-null    float64
 2   Gender      89 non-null     object
 3   Email       105 non-null    object
 4   Join_Date   26 non-null     datetime64[ns]
 5   Salary      64 non-null     float64
 6   Department  89 non-null     object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 5.9+ KB

In [31]:
# handling department column
y = ds["Department"].mode()[0] # mode() - most frequent values in dataset
y

'Engineering'

In [31]:
y = ds["Department"].mode()[0]
ds["Department"].fillna(y, inplace = True)

C:\Users\SHRUTI\AppData\Local\Temp\ipykernel_17684\1088581000.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Department"].fillna(y, inplace = True)

In [32]:
# To save file

ds.to_csv("cleaned_data.csv")

In [33]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         105 non-null    float64
 2   Gender      89 non-null     object
 3   Email       105 non-null    object
 4   Join_Date   26 non-null     datetime64[ns]
 5   Salary      64 non-null     float64
 6   Department  105 non-null    object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 5.9+ KB